УправлениеПаркомАттракционов/src/Documents/ПродажаБилета/ПродажаБилета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПродажаБилета</name>
  <registerRecords>AccumulationRegister.АктивныеПосещения</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.БонусныеБаллыКлиентов</registerRecords>
  <attributes>
    <name>УдалитьНоменклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЦена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БаллыКСписанию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПозицииПродажи</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УправлениеПаркомАттракционов/src/AccumulationRegisters/АктивныеПосещения/АктивныеПосещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>АктивныеПосещения</name>
  <resources>
    <name>КоличествоПосещений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПродажаБилета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидАттракциона</name>
    <type>
      <types>CatalogRef.ВидыАттракционов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УправлениеПаркомАттракционов/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидАттракциона</name>
    <type>
      <types>CatalogRef.ВидыАттракционов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УправлениеПаркомАттракционов/src/AccumulationRegisters/БонусныеБаллыКлиентов/БонусныеБаллыКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>БонусныеБаллыКлиентов</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УправлениеПаркомАттракционов/src/InformationRegisters/АктуальнаяШкалаБонуснойПрограммы/АктуальнаяШкалаБонуснойПрограммы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АктуальнаяШкалаБонуснойПрограммы</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Шкала</name>
    <type>
      <types>DocumentRef.ШкалаБонуснойПрограммы</types>
    </type>
  </resources>
</mdclass:InformationRegister>

УправлениеПаркомАттракционов/src/Documents/ШкалаБонуснойПрограммы/ШкалаБонуснойПрограммы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ШкалаБонуснойПрограммы</name>
  <registerRecords>InformationRegister.АктуальнаяШкалаБонуснойПрограммы</registerRecords>
  <tabularSections>
    <name>Диапазоны</name>
    <attributes>
      <name>НижняяГраницаПродаж</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВерхняяГраницаПродаж</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентНакопления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УправлениеПаркомАттракционов/src/Documents/ПродажаБилета/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	Движения.АктивныеПосещения.Записывать = Истина;
	Движения.Продажи.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПродажаБилетаПозицииПродажи.Номенклатура.ВидАттракциона КАК ВидАттракциона,
	|	ПродажаБилетаПозицииПродажи.Номенклатура.КоличествоПосещений * ПродажаБилетаПозицииПродажи.Количество КАК
	|		КоличествоПосещений,
	|	ПродажаБилетаПозицииПродажи.Сумма
	|ИЗ
	|	Документ.ПродажаБилета.ПозицииПродажи КАК ПродажаБилетаПозицииПродажи
	|ГДЕ
	|	ПродажаБилетаПозицииПродажи.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		// регистр АктивныеПосещения
		Движение = Движения.АктивныеПосещения.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Основание = Ссылка;
		Движение.ВидАттракциона = Выборка.ВидАттракциона;
		Движение.КоличествоПосещений = Выборка.КоличествоПосещений;

		// регистр Продажи
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.ВидАттракциона = Выборка.ВидАттракциона;
		Движение.Сумма = Выборка.Сумма;
		
		
	КонецЦикла;

	НачислитьСписатьБонусныеБаллы(Отказ);

КонецПроцедуры


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
		МаксимальнаяДоля = Константы.МаксимальнаяДоляОплатыБаллами.Получить();
		
		Если БаллыКСписанию <> 0 Тогда
			
				Если БаллыКСписанию > УдалитьЦена Тогда
						Отказ = Истина;
						Сообщение = Новый СообщениеПользователю;
						Сообщение.Текст = "Списываемые баллы не должны превышать цену билета";
						Сообщение.УстановитьДанные(ЭтотОбъект);
						Сообщение.Поле = "БаллыКСписанию";
						Сообщение.Сообщить();
				КонецЕсли;
		
				Если УдалитьЦена <> 0 Тогда
						Доля = (БаллыКСписанию / УдалитьЦена) * 100;
						Если Доля > МаксимальнаяДоля Тогда
								Отказ = Истина;
								Сообщение = Новый СообщениеПользователю;
								Сообщение.Текст = СтрШаблон("Доля списываемых баллов от цены больше допустимой (%1%%)", МаксимальнаяДоля);
								Сообщение.УстановитьДанные(ЭтотОбъект);
								Сообщение.Поле = "БаллыКСписанию";
								Сообщение.Сообщить();
						КонецЕсли;
						
				КонецЕсли;
				
		КонецЕсли;
		
				
КонецПроцедуры


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура НачислитьСписатьБонусныеБаллы(Отказ)
	
	Движения.БонусныеБаллыКлиентов.Записывать = Истина;
	
	Если НЕ ЗначениеЗаполнено(Клиент) Тогда
		Возврат;
	КонецЕсли;
	
	СуммаПокупокКлиента = СуммаПокупокКлиента();
	
	ДоляНакапливаемыхБаллов = ДоляНакапливаемыхБаллов(СуммаПокупокКлиента); 
	
	БаллыКНакоплению = СуммаДокумента * ДоляНакапливаемыхБаллов / 100;
	
	Если БаллыКНакоплению <> 0 Тогда
		
		Движение = Движения.БонусныеБаллыКлиентов.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.Сумма = БаллыКНакоплению;
		
	КонецЕсли;
	
	Если БаллыКСписанию <> 0 Тогда
		
		Движение = Движения.БонусныеБаллыКлиентов.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.Сумма = БаллыКСписанию;
	
	КонецЕсли;
	
	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БонусныеБаллыКлиентовОстатки.СуммаОстаток
	|ИЗ
	|	РегистрНакопления.БонусныеБаллыКлиентов.Остатки(&Период, Клиент = &Клиент) КАК БонусныеБаллыКлиентовОстатки
	|ГДЕ
	|	БонусныеБаллыКлиентовОстатки.СуммаОстаток < 0";
	
	Запрос.УстановитьПараметр("Период", Новый Граница(МоментВремени(), ВидГраницы.Включая) );
	Запрос.УстановитьПараметр("Клиент", Клиент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Не хватает баллов для списания, на балансе %1", 
			(Выборка.СуммаОстаток + БаллыКСписанию));
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Поле = "БаллыКСписанию";
		Сообщение.Сообщить();
	
	КонецЕсли;
	
КонецПроцедуры

Функция СуммаПокупокКлиента()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПродажиОбороты.СуммаОборот
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(, &КонецПериода,, Клиент = &Клиент) КАК ПродажиОбороты";
	
	Запрос.УстановитьПараметр("КонецПериода", Новый Граница(МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Клиент", Клиент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СуммаОборот;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция ДоляНакапливаемыхБаллов(СуммаПокупокКлиента)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ШкалаБонуснойПрограммыДиапазоны.ПроцентНакопления
	|ИЗ
	|	РегистрСведений.АктуальнаяШкалаБонуснойПрограммы.СрезПоследних(&Период,) КАК
	|		АктуальнаяШкалаБонуснойПрограммыСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ШкалаБонуснойПрограммы.Диапазоны КАК ШкалаБонуснойПрограммыДиапазоны
	|		ПО АктуальнаяШкалаБонуснойПрограммыСрезПоследних.Шкала = ШкалаБонуснойПрограммыДиапазоны.Ссылка
	|ГДЕ
	|	ШкалаБонуснойПрограммыДиапазоны.НижняяГраницаПродаж <= &СуммаПокупок
	|	И (ШкалаБонуснойПрограммыДиапазоны.ВерхняяГраницаПродаж > &СуммаПокупок
	|	ИЛИ ШкалаБонуснойПрограммыДиапазоны.ВерхняяГраницаПродаж = 0)";

	Запрос.УстановитьПараметр("СуммаПокупок", СуммаПокупокКлиента);
	Запрос.УстановитьПараметр("Период", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПроцентНакопления;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции


#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
